EDT/УТ/src/Documents/мгШтрафыПДД/мгШтрафыПДД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгШтрафыПДД</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Удержание</name>
    <comment>(Миго-групп)</comment>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрафыПДД</name>
    <attributes>
      <name>ФИОСотрудника</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Documents/мгШтрафыПДД/Forms/ФормаДокументаУпр/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ШтрафыПДДФИОСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ШтрафыПДД.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ФИОСотрудника) Тогда
		ДанныеСотрудника = мгДоработки.ПолучитьОрганизациюСотрудника(ТекущиеДанные.ФИОСотрудника);
		Если ДанныеСотрудника.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник не принят ни в одну организацию";
			Сообщение.Сообщить();
		ИначеЕсли ДанныеСотрудника.Количество() > 1 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Сотрудник принят в несколько организаций, необходимо выбрать организацию сотрудника";
			Сообщение.Сообщить();
		Иначе
			ТекущиеДанные.Организация = ДанныеСотрудника[0].Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	
КонецПроцедуры
